<template>
  <div class="notice-wrapper">
      <div id="liveSourceTime" style="height: 500px;"></div>
  </div>
</template>

<script>
import { commonPush } from '@/api'
import { urlParse, saveStorage, loadStorage, formatTime } from '@/util/tools'
export default {
  name: 'dataBoard',
  data() {
    return {
      liveId: urlParse().liveId,
      liveSourceTimeList: [],
      liveSourceTimeOptions: {
          legend: ''
      }
    }
  },
  created() {
      this.getLiveData()
  },
  methods: {
    formatLiveSourceTime() {
        console.log(this.liveSourceTimeList)
        let legend = []
        let xAxisDate = []
        let list = this.liveSourceTimeList
        list.forEach(item => {
            item.x = formatTime(item.x, 'hh:mm')
            if (!legend.includes(item.title)) {
                legend.push(item.title)
            }
            if (!xAxisDate.includes(item.x)) {
                xAxisDate.push(item.x)
            }
        })
        console.log(legend, xAxisDate)
        this.$nextTick(() => {
            this.initLiveSourceTime()
        })
    },
    initLiveSourceTime() {
        this.liveSourceTime = echarts.init(document.getElementById('liveSourceTime'))
        let option = {
            tooltip : {
                trigger: 'axis'
            },
            legend: {
                data:['邮件营销','联盟广告','视频广告','直接访问','搜索引擎']
            },
            // toolbox: {
            //     show : true,
            //     feature : {
            //         mark : {show: true},
            //         dataView : {show: true, readOnly: false},
            //         magicType : {show: true, type: ['line', 'bar', 'stack', 'tiled']},
            //         restore : {show: true},
            //         saveAsImage : {show: true}
            //     }
            // },
            // calculable : true,
            xAxis : [
                {
                    type : 'category',
                    // boundaryGap : false,
                    data : ['周一','周二','周三','周四','周五','周六','周日']
                }
            ],
            yAxis : [
                {
                    type : 'value'
                }
            ],
            series : [
                {
                    name:'邮件营销',
                    type:'line',
                    stack: '总量1',
                    data:[120, 132, 101, 134, 90, 230, 210]
                },
                {
                    name:'联盟广告',
                    type:'line',
                    stack: '总量2',
                    data:[220, 182, 191, 234, 290, 330, 310]
                },
                {
                    name:'视频广告',
                    type:'line',
                    stack: '总量3',
                    data:[150, 232, 201, 154, 190, 330, 410]
                },
                {
                    name:'直接访问',
                    type:'line',
                    stack: '总量4',
                    data:[320, 332, 301, 334, 390, 330, 320]
                },
                {
                    name:'搜索引擎',
                    type:'line',
                    stack: '总量5',
                    data:[820, 932, 901, 934, 1290, 1330, 1320]
                }
            ]
        }
        this.liveSourceTime.setOption(option)
                    
    },
    // 获取直播间数据
    getLiveData() {
      let params = {
          queryType: 0,
          liveId: this.liveId,
          api: 'query_data'
      }
      let res = {"headers":{},"model":{"data":{"fansNewUV":0,"fansAvgViewTimeMsg":{"rise":false,"dataInfo":"下降100%"},"fansViewBackRate":0.0,"fansLeaveUV":0,"totalViewPV":1,"fansInRate":0.0,"liveSourceTimeList":[{"title":"淘宝直播频道","y":0,"x":1552613340000},{"title":"淘宝直播频道","y":0,"x":1552613400000},{"title":"淘宝直播频道","y":0,"x":1552613460000},{"title":"淘宝直播频道","y":0,"x":1552613520000},{"title":"淘宝直播频道","y":0,"x":1552613580000},{"title":"淘宝直播频道","y":0,"x":1552613640000},{"title":"淘宝直播频道","y":0,"x":1552613700000},{"title":"淘宝直播频道","y":0,"x":1552613760000},{"title":"淘宝直播频道","y":0,"x":1552613820000},{"title":"淘宝直播频道","y":0,"x":1552613880000},{"title":"淘宝直播频道","y":0,"x":1552613940000},{"title":"淘宝直播频道","y":0,"x":1552614000000},{"title":"淘宝直播频道","y":0,"x":1552614060000},{"title":"淘宝直播频道","y":0,"x":1552614120000},{"title":"淘宝直播频道","y":0,"x":1552614180000},{"title":"淘宝直播频道","y":0,"x":1552614240000},{"title":"淘宝直播频道","y":0,"x":1552614300000},{"title":"淘宝直播频道","y":0,"x":1552614360000},{"title":"淘宝直播频道","y":0,"x":1552614420000},{"title":"淘宝直播频道","y":0,"x":1552614480000},{"title":"淘宝直播频道","y":0,"x":1552614540000},{"title":"淘宝直播频道","y":0,"x":1552614600000},{"title":"淘宝直播频道","y":0,"x":1552614660000},{"title":"淘宝直播频道","y":0,"x":1552614720000},{"title":"淘宝直播频道","y":0,"x":1552614780000},{"title":"淘宝直播频道","y":0,"x":1552614840000},{"title":"淘宝直播频道","y":0,"x":1552614900000},{"title":"淘宝直播频道","y":0,"x":1552614960000},{"title":"淘宝直播频道","y":0,"x":1552615020000},{"title":"淘宝直播频道","y":0,"x":1552615080000},{"title":"粉丝推送","y":0,"x":1552613340000},{"title":"粉丝推送","y":0,"x":1552613400000},{"title":"粉丝推送","y":0,"x":1552613460000},{"title":"粉丝推送","y":0,"x":1552613520000},{"title":"粉丝推送","y":0,"x":1552613580000},{"title":"粉丝推送","y":0,"x":1552613640000},{"title":"粉丝推送","y":0,"x":1552613700000},{"title":"粉丝推送","y":0,"x":1552613760000},{"title":"粉丝推送","y":0,"x":1552613820000},{"title":"粉丝推送","y":0,"x":1552613880000},{"title":"粉丝推送","y":0,"x":1552613940000},{"title":"粉丝推送","y":0,"x":1552614000000},{"title":"粉丝推送","y":0,"x":1552614060000},{"title":"粉丝推送","y":0,"x":1552614120000},{"title":"粉丝推送","y":0,"x":1552614180000},{"title":"粉丝推送","y":0,"x":1552614240000},{"title":"粉丝推送","y":0,"x":1552614300000},{"title":"粉丝推送","y":0,"x":1552614360000},{"title":"粉丝推送","y":0,"x":1552614420000},{"title":"粉丝推送","y":0,"x":1552614480000},{"title":"粉丝推送","y":0,"x":1552614540000},{"title":"粉丝推送","y":0,"x":1552614600000},{"title":"粉丝推送","y":0,"x":1552614660000},{"title":"粉丝推送","y":0,"x":1552614720000},{"title":"粉丝推送","y":0,"x":1552614780000},{"title":"粉丝推送","y":0,"x":1552614840000},{"title":"粉丝推送","y":0,"x":1552614900000},{"title":"粉丝推送","y":0,"x":1552614960000},{"title":"粉丝推送","y":0,"x":1552615020000},{"title":"粉丝推送","y":0,"x":1552615080000},{"title":"微淘","y":0,"x":1552613340000},{"title":"微淘","y":0,"x":1552613400000},{"title":"微淘","y":0,"x":1552613460000},{"title":"微淘","y":0,"x":1552613520000},{"title":"微淘","y":0,"x":1552613580000},{"title":"微淘","y":0,"x":1552613640000},{"title":"微淘","y":0,"x":1552613700000},{"title":"微淘","y":0,"x":1552613760000},{"title":"微淘","y":0,"x":1552613820000},{"title":"微淘","y":0,"x":1552613880000},{"title":"微淘","y":0,"x":1552613940000},{"title":"微淘","y":0,"x":1552614000000},{"title":"微淘","y":0,"x":1552614060000},{"title":"微淘","y":0,"x":1552614120000},{"title":"微淘","y":0,"x":1552614180000},{"title":"微淘","y":0,"x":1552614240000},{"title":"微淘","y":0,"x":1552614300000},{"title":"微淘","y":0,"x":1552614360000},{"title":"微淘","y":0,"x":1552614420000},{"title":"微淘","y":0,"x":1552614480000},{"title":"微淘","y":0,"x":1552614540000},{"title":"微淘","y":0,"x":1552614600000},{"title":"微淘","y":0,"x":1552614660000},{"title":"微淘","y":0,"x":1552614720000},{"title":"微淘","y":0,"x":1552614780000},{"title":"微淘","y":0,"x":1552614840000},{"title":"微淘","y":0,"x":1552614900000},{"title":"微淘","y":0,"x":1552614960000},{"title":"微淘","y":0,"x":1552615020000},{"title":"微淘","y":0,"x":1552615080000},{"title":"频道-关注","y":0,"x":1552613340000},{"title":"频道-关注","y":0,"x":1552613400000},{"title":"频道-关注","y":0,"x":1552613460000},{"title":"频道-关注","y":0,"x":1552613520000},{"title":"频道-关注","y":0,"x":1552613580000},{"title":"频道-关注","y":0,"x":1552613640000},{"title":"频道-关注","y":0,"x":1552613700000},{"title":"频道-关注","y":0,"x":1552613760000},{"title":"频道-关注","y":0,"x":1552613820000},{"title":"频道-关注","y":0,"x":1552613880000},{"title":"频道-关注","y":0,"x":1552613940000},{"title":"频道-关注","y":0,"x":1552614000000},{"title":"频道-关注","y":0,"x":1552614060000},{"title":"频道-关注","y":0,"x":1552614120000},{"title":"频道-关注","y":0,"x":1552614180000},{"title":"频道-关注","y":0,"x":1552614240000},{"title":"频道-关注","y":0,"x":1552614300000},{"title":"频道-关注","y":0,"x":1552614360000},{"title":"频道-关注","y":0,"x":1552614420000},{"title":"频道-关注","y":0,"x":1552614480000},{"title":"频道-关注","y":0,"x":1552614540000},{"title":"频道-关注","y":0,"x":1552614600000},{"title":"频道-关注","y":0,"x":1552614660000},{"title":"频道-关注","y":0,"x":1552614720000},{"title":"频道-关注","y":0,"x":1552614780000},{"title":"频道-关注","y":0,"x":1552614840000},{"title":"频道-关注","y":0,"x":1552614900000},{"title":"频道-关注","y":0,"x":1552614960000},{"title":"频道-关注","y":0,"x":1552615020000},{"title":"频道-关注","y":0,"x":1552615080000},{"title":"搜索","y":0,"x":1552613340000},{"title":"搜索","y":0,"x":1552613400000},{"title":"搜索","y":0,"x":1552613460000},{"title":"搜索","y":0,"x":1552613520000},{"title":"搜索","y":0,"x":1552613580000},{"title":"搜索","y":0,"x":1552613640000},{"title":"搜索","y":0,"x":1552613700000},{"title":"搜索","y":0,"x":1552613760000},{"title":"搜索","y":0,"x":1552613820000},{"title":"搜索","y":0,"x":1552613880000},{"title":"搜索","y":0,"x":1552613940000},{"title":"搜索","y":0,"x":1552614000000},{"title":"搜索","y":0,"x":1552614060000},{"title":"搜索","y":0,"x":1552614120000},{"title":"搜索","y":0,"x":1552614180000},{"title":"搜索","y":0,"x":1552614240000},{"title":"搜索","y":0,"x":1552614300000},{"title":"搜索","y":0,"x":1552614360000},{"title":"搜索","y":0,"x":1552614420000},{"title":"搜索","y":0,"x":1552614480000},{"title":"搜索","y":0,"x":1552614540000},{"title":"搜索","y":0,"x":1552614600000},{"title":"搜索","y":0,"x":1552614660000},{"title":"搜索","y":0,"x":1552614720000},{"title":"搜索","y":0,"x":1552614780000},{"title":"搜索","y":0,"x":1552614840000},{"title":"搜索","y":0,"x":1552614900000},{"title":"搜索","y":0,"x":1552614960000},{"title":"搜索","y":0,"x":1552615020000},{"title":"搜索","y":0,"x":1552615080000},{"title":"分享","y":0,"x":1552613340000},{"title":"分享","y":0,"x":1552613400000},{"title":"分享","y":0,"x":1552613460000},{"title":"分享","y":0,"x":1552613520000},{"title":"分享","y":0,"x":1552613580000},{"title":"分享","y":0,"x":1552613640000},{"title":"分享","y":0,"x":1552613700000},{"title":"分享","y":0,"x":1552613760000},{"title":"分享","y":0,"x":1552613820000},{"title":"分享","y":0,"x":1552613880000},{"title":"分享","y":0,"x":1552613940000},{"title":"分享","y":0,"x":1552614000000},{"title":"分享","y":0,"x":1552614060000},{"title":"分享","y":0,"x":1552614120000},{"title":"分享","y":0,"x":1552614180000},{"title":"分享","y":0,"x":1552614240000},{"title":"分享","y":0,"x":1552614300000},{"title":"分享","y":0,"x":1552614360000},{"title":"分享","y":0,"x":1552614420000},{"title":"分享","y":0,"x":1552614480000},{"title":"分享","y":0,"x":1552614540000},{"title":"分享","y":0,"x":1552614600000},{"title":"分享","y":0,"x":1552614660000},{"title":"分享","y":0,"x":1552614720000},{"title":"分享","y":0,"x":1552614780000},{"title":"分享","y":0,"x":1552614840000},{"title":"分享","y":0,"x":1552614900000},{"title":"分享","y":0,"x":1552614960000},{"title":"分享","y":0,"x":1552615020000},{"title":"分享","y":0,"x":1552615080000},{"title":"直播间切换","y":0,"x":1552613340000},{"title":"直播间切换","y":0,"x":1552613400000},{"title":"直播间切换","y":0,"x":1552613460000},{"title":"直播间切换","y":0,"x":1552613520000},{"title":"直播间切换","y":0,"x":1552613580000},{"title":"直播间切换","y":0,"x":1552613640000},{"title":"直播间切换","y":0,"x":1552613700000},{"title":"直播间切换","y":0,"x":1552613760000},{"title":"直播间切换","y":0,"x":1552613820000},{"title":"直播间切换","y":0,"x":1552613880000},{"title":"直播间切换","y":0,"x":1552613940000},{"title":"直播间切换","y":0,"x":1552614000000},{"title":"直播间切换","y":0,"x":1552614060000},{"title":"直播间切换","y":0,"x":1552614120000},{"title":"直播间切换","y":0,"x":1552614180000},{"title":"直播间切换","y":0,"x":1552614240000},{"title":"直播间切换","y":0,"x":1552614300000},{"title":"直播间切换","y":0,"x":1552614360000},{"title":"直播间切换","y":0,"x":1552614420000},{"title":"直播间切换","y":0,"x":1552614480000},{"title":"直播间切换","y":0,"x":1552614540000},{"title":"直播间切换","y":0,"x":1552614600000},{"title":"直播间切换","y":0,"x":1552614660000},{"title":"直播间切换","y":0,"x":1552614720000},{"title":"直播间切换","y":0,"x":1552614780000},{"title":"直播间切换","y":0,"x":1552614840000},{"title":"直播间切换","y":0,"x":1552614900000},{"title":"直播间切换","y":0,"x":1552614960000},{"title":"直播间切换","y":0,"x":1552615020000},{"title":"直播间切换","y":0,"x":1552615080000},{"title":"其他渠道","y":0,"x":1552613340000},{"title":"其他渠道","y":0,"x":1552613400000},{"title":"其他渠道","y":0,"x":1552613460000},{"title":"其他渠道","y":0,"x":1552613520000},{"title":"其他渠道","y":0,"x":1552613580000},{"title":"其他渠道","y":0,"x":1552613640000},{"title":"其他渠道","y":0,"x":1552613700000},{"title":"其他渠道","y":0,"x":1552613760000},{"title":"其他渠道","y":0,"x":1552613820000},{"title":"其他渠道","y":0,"x":1552613880000},{"title":"其他渠道","y":0,"x":1552613940000},{"title":"其他渠道","y":0,"x":1552614000000},{"title":"其他渠道","y":0,"x":1552614060000},{"title":"其他渠道","y":0,"x":1552614120000},{"title":"其他渠道","y":0,"x":1552614180000},{"title":"其他渠道","y":0,"x":1552614240000},{"title":"其他渠道","y":0,"x":1552614300000},{"title":"其他渠道","y":0,"x":1552614360000},{"title":"其他渠道","y":0,"x":1552614420000},{"title":"其他渠道","y":0,"x":1552614480000},{"title":"其他渠道","y":0,"x":1552614540000},{"title":"其他渠道","y":0,"x":1552614600000},{"title":"其他渠道","y":0,"x":1552614660000},{"title":"其他渠道","y":0,"x":1552614720000},{"title":"其他渠道","y":0,"x":1552614780000},{"title":"其他渠道","y":0,"x":1552614840000},{"title":"其他渠道","y":0,"x":1552614900000},{"title":"其他渠道","y":0,"x":1552614960000},{"title":"其他渠道","y":0,"x":1552615020000},{"title":"其他渠道","y":0,"x":1552615080000}],"fansViewBackUV":0,"fansInUV":0,"totalLiveTimeList":[{"title":"整体进入","y":0,"x":1552613340000},{"title":"整体进入","y":0,"x":1552613400000},{"title":"整体进入","y":0,"x":1552613460000},{"title":"整体进入","y":0,"x":1552613520000},{"title":"整体进入","y":0,"x":1552613580000},{"title":"整体进入","y":0,"x":1552613640000},{"title":"整体进入","y":0,"x":1552613700000},{"title":"整体进入","y":0,"x":1552613760000},{"title":"整体进入","y":0,"x":1552613820000},{"title":"整体进入","y":0,"x":1552613880000},{"title":"整体进入","y":0,"x":1552613940000},{"title":"整体进入","y":0,"x":1552614000000},{"title":"整体进入","y":0,"x":1552614060000},{"title":"整体进入","y":0,"x":1552614120000},{"title":"整体进入","y":0,"x":1552614180000},{"title":"整体进入","y":1,"x":1552614240000},{"title":"整体进入","y":0,"x":1552614300000},{"title":"整体进入","y":0,"x":1552614360000},{"title":"整体进入","y":0,"x":1552614420000},{"title":"整体进入","y":0,"x":1552614480000},{"title":"整体进入","y":0,"x":1552614540000},{"title":"整体进入","y":0,"x":1552614600000},{"title":"整体进入","y":0,"x":1552614660000},{"title":"整体进入","y":0,"x":1552614720000},{"title":"整体进入","y":0,"x":1552614780000},{"title":"整体进入","y":0,"x":1552614840000},{"title":"整体进入","y":0,"x":1552614900000},{"title":"整体进入","y":0,"x":1552614960000},{"title":"整体进入","y":0,"x":1552615020000},{"title":"整体进入","y":0,"x":1552615080000},{"title":"整体离开","y":0,"x":1552613340000},{"title":"整体离开","y":0,"x":1552613400000},{"title":"整体离开","y":0,"x":1552613460000},{"title":"整体离开","y":0,"x":1552613520000},{"title":"整体离开","y":0,"x":1552613580000},{"title":"整体离开","y":0,"x":1552613640000},{"title":"整体离开","y":0,"x":1552613700000},{"title":"整体离开","y":0,"x":1552613760000},{"title":"整体离开","y":0,"x":1552613820000},{"title":"整体离开","y":0,"x":1552613880000},{"title":"整体离开","y":0,"x":1552613940000},{"title":"整体离开","y":0,"x":1552614000000},{"title":"整体离开","y":0,"x":1552614060000},{"title":"整体离开","y":0,"x":1552614120000},{"title":"整体离开","y":0,"x":1552614180000},{"title":"整体离开","y":0,"x":1552614240000},{"title":"整体离开","y":0,"x":1552614300000},{"title":"整体离开","y":0,"x":1552614360000},{"title":"整体离开","y":0,"x":1552614420000},{"title":"整体离开","y":0,"x":1552614480000},{"title":"整体离开","y":0,"x":1552614540000},{"title":"整体离开","y":0,"x":1552614600000},{"title":"整体离开","y":0,"x":1552614660000},{"title":"整体离开","y":0,"x":1552614720000},{"title":"整体离开","y":0,"x":1552614780000},{"title":"整体离开","y":0,"x":1552614840000},{"title":"整体离开","y":0,"x":1552614900000},{"title":"整体离开","y":0,"x":1552614960000},{"title":"整体离开","y":0,"x":1552615020000},{"title":"整体离开","y":0,"x":1552615080000},{"title":"粉丝进入","y":0,"x":1552613340000},{"title":"粉丝进入","y":0,"x":1552613400000},{"title":"粉丝进入","y":0,"x":1552613460000},{"title":"粉丝进入","y":0,"x":1552613520000},{"title":"粉丝进入","y":0,"x":1552613580000},{"title":"粉丝进入","y":0,"x":1552613640000},{"title":"粉丝进入","y":0,"x":1552613700000},{"title":"粉丝进入","y":0,"x":1552613760000},{"title":"粉丝进入","y":0,"x":1552613820000},{"title":"粉丝进入","y":0,"x":1552613880000},{"title":"粉丝进入","y":0,"x":1552613940000},{"title":"粉丝进入","y":0,"x":1552614000000},{"title":"粉丝进入","y":0,"x":1552614060000},{"title":"粉丝进入","y":0,"x":1552614120000},{"title":"粉丝进入","y":0,"x":1552614180000},{"title":"粉丝进入","y":0,"x":1552614240000},{"title":"粉丝进入","y":0,"x":1552614300000},{"title":"粉丝进入","y":0,"x":1552614360000},{"title":"粉丝进入","y":0,"x":1552614420000},{"title":"粉丝进入","y":0,"x":1552614480000},{"title":"粉丝进入","y":0,"x":1552614540000},{"title":"粉丝进入","y":0,"x":1552614600000},{"title":"粉丝进入","y":0,"x":1552614660000},{"title":"粉丝进入","y":0,"x":1552614720000},{"title":"粉丝进入","y":0,"x":1552614780000},{"title":"粉丝进入","y":0,"x":1552614840000},{"title":"粉丝进入","y":0,"x":1552614900000},{"title":"粉丝进入","y":0,"x":1552614960000},{"title":"粉丝进入","y":0,"x":1552615020000},{"title":"粉丝进入","y":0,"x":1552615080000},{"title":"粉丝离开","y":0,"x":1552613340000},{"title":"粉丝离开","y":0,"x":1552613400000},{"title":"粉丝离开","y":0,"x":1552613460000},{"title":"粉丝离开","y":0,"x":1552613520000},{"title":"粉丝离开","y":0,"x":1552613580000},{"title":"粉丝离开","y":0,"x":1552613640000},{"title":"粉丝离开","y":0,"x":1552613700000},{"title":"粉丝离开","y":0,"x":1552613760000},{"title":"粉丝离开","y":0,"x":1552613820000},{"title":"粉丝离开","y":0,"x":1552613880000},{"title":"粉丝离开","y":0,"x":1552613940000},{"title":"粉丝离开","y":0,"x":1552614000000},{"title":"粉丝离开","y":0,"x":1552614060000},{"title":"粉丝离开","y":0,"x":1552614120000},{"title":"粉丝离开","y":0,"x":1552614180000},{"title":"粉丝离开","y":0,"x":1552614240000},{"title":"粉丝离开","y":0,"x":1552614300000},{"title":"粉丝离开","y":0,"x":1552614360000},{"title":"粉丝离开","y":0,"x":1552614420000},{"title":"粉丝离开","y":0,"x":1552614480000},{"title":"粉丝离开","y":0,"x":1552614540000},{"title":"粉丝离开","y":0,"x":1552614600000},{"title":"粉丝离开","y":0,"x":1552614660000},{"title":"粉丝离开","y":0,"x":1552614720000},{"title":"粉丝离开","y":0,"x":1552614780000},{"title":"粉丝离开","y":0,"x":1552614840000},{"title":"粉丝离开","y":0,"x":1552614900000},{"title":"粉丝离开","y":0,"x":1552614960000},{"title":"粉丝离开","y":0,"x":1552615020000},{"title":"粉丝离开","y":0,"x":1552615080000}],"curDataTime":0,"fansAvgViewTimeRate":0.0,"totalActivityPV":0,"liveInfo":{"weitaoFeedId":0,"totalJoinCount":0,"vrType":0,"expired":false,"accountId":1950250590,"location":"北京","gmtCreateTime":0,"bizCode":"TAOBAO","liveUrlList":[{"definition":"ld","flvUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a_liveng-360p.flv?auth_key=1555206236-0-0-f24217395f5cc0af6d478fd825fe6f79","name":"流畅","hlsUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a_liveng-360p.m3u8?auth_key=1555206236-0-0-b08b63675f4797a320c0c6348a5971b5","rtmpUrl":"rtmp://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a_liveng-360p?auth_key=1555206236-0-0-85fdedccc0b658f4eee1e21da63099e5","codeLevel":1},{"definition":"md","flvUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a.flv?auth_key=1555206236-0-0-279ebc2c2dbb2429431b241750e4de5a","name":"高清","hlsUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a.m3u8?auth_key=1555206236-0-0-a57909b6e7e718e08ed50ffa8797e9eb","rtmpUrl":"rtmp://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a?auth_key=1555206236-0-0-d4e8d733b33ae336047ec3cdebead109","codeLevel":2},{"definition":"lld","flvUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a_liveng-270p.flv?auth_key=1555206236-0-0-6d3a9e69a33f5d2869a2e876cd318b60","name":"超级流畅","hlsUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a_liveng-270p.m3u8?auth_key=1555206236-0-0-f79a582ef59db5f267a4b79a7c45a688","rtmpUrl":"rtmp://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a_liveng-270p?auth_key=1555206236-0-0-103fd213d69b95367c119a60ece2eb46","codeLevel":0}],"type":508,"endTime":1555206242000,"liveChannelId":7,"startTime":1552614242000,"id":"221127184499","title":"测试","free":false,"coverImg":"//gw.alicdn.com/tfscom/i2/O1CN01Sd7XWr1GEGBS5Soit_!!0-dgshop.jpg","subAccountName":"","landScape":false,"liveUrlHls":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a.m3u8?auth_key=1555206236-0-0-a57909b6e7e718e08ed50ffa8797e9eb","publishSource":1,"liveUrl":"http://liveng.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a.flv?auth_key=1555206236-0-0-279ebc2c2dbb2429431b241750e4de5a","replayUrl":"http://livenging.alicdn.com/mediaplatform/58fb9728-b3f5-4176-a4f3-547a7b3c9d6a.m3u8","topic":"58fb9728-b3f5-4176-a4f3-547a7b3c9d6a","tags":"每日上新","praiseCount":0,"descInfo":"测试","nativeFeedDetailUrl":"//h5.m.taobao.com/taolive/video.html?id=221127184499&amp;type=508&amp;livetype=living&amp;vrType=0","sxm":"6.221127184499","status":3,"alert":false,"liveColumnId":123,"userNick":"构美官方直播","gameId":0,"liveId":221127184499,"approval":1,"roomStatus":1,"coverImg916":"//img.alicdn.com/imgextra/null","subAccountId":0,"appointmentTime":1552614835946,"streamStatus":0,"roomType":0,"joinCount":0,"coverImg169":"//gw.alicdn.com/tfscom/i1/O1CN01sppFZZ1GEGBNdEIVz_!!0-dgshop.jpg","totalViewCount":0,"gmtModifyTime":0,"viewCount":0,"h265":false,"curItemNum":0},"curOnlineUV":2,"totalItemClickPV":0,"fansInUVMsg":{"rise":false,"dataInfo":"下降100%"},"preLiveId":221072508023,"maxOnlineUV":2,"fansAvgViewTime":0,"avgViewTime":0}},"httpStatusCode":200,"msgCode":"SUCCESS","msgInfo":"成功","success":true}
    //   commonPush(params).then(res => {
          console.log(res)
          this.liveSourceTimeList = res.model.data.liveSourceTimeList
          this.formatLiveSourceTime()
    //   })
    }
  },
  components: {},
  watch: {}
}
</script>

<style lang="less">
.data-board-wrapper {
}
</style>
